# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'stripe/stripe-cli'

# Binaries and Libraries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'dos2unix'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mutagen-io/mutagen/mutagen'
brew 'openconnect'
brew 'packer'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'pv'
brew 'sponge'
brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'nativefier'
brew 'colordiff'
brew 'gnu-sed'
brew 'gawk'
brew 'vagrant'
brew 'wget'
brew 'yq'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mutagen-io/mutagen/mutagen'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'nvm'
brew 'ruby'
brew 'rbenv'

# Shell
brew 'zsh-autosuggestions'

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'audio-hijack'
cask 'authy'
cask 'bartender'
cask 'sketch'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'dropbox'
cask 'droplr'
cask 'fantastical'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'jetbrains-toolbox'
cask 'loopback'
cask 'miro'
cask 'obs'
cask 'parallels'
cask 'parallels-virtualization-sdk'
cask 'screenflow'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram'
cask 'the-unarchiver'
cask 'there'
cask 'tinkerwell'
cask 'transmission'
cask 'transmit'
cask 'typora'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-inter'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Byword', id: 420212497
mas 'Harvest', id: 506189836
mas 'Keynote', id: 409183694
mas 'Kiwi for Gmail', id: 986304488
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Word', id: 462054704
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Petrify', id: 1451177988
mas 'Reeder', id: 1529448980
mas 'Speedtest', id: 1153157709
mas 'Spike', id: 707452888
mas 'Todoist', id: 585829637
mas 'ToothFairy', id: 1191449274
mas 'Trello', id: 1278508951
mas 'Twitter', id: 1482454543
