# Taps
#tap 'adoptopenjdk/openjdk'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'jakehilborn/jakehilborn'
tap 'mutagen-io/mutagen'
tap 'stripe/stripe-cli'

# Binaries and Libraries
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'cmake'
brew 'displayplacer'
brew 'dnsmasq'
brew 'docker'
brew 'docker-compose'
brew 'dos2unix'
brew 'exiftool'
brew 'ffmpeg'
brew 'gallery-dl'
brew 'gh'
brew 'git'
brew 'glow'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'libtool'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mosh'
brew 'mutagen-io/mutagen/mutagen'
brew 'openconnect'
brew 'packer'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'pv'
brew 'pyenv'
brew 'sponge'
brew 'rabbitmq'
brew 'rabbitmq-c'
brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'nativefier'
brew 'colordiff'
brew 'gnu-sed'
brew 'gawk'
#brew 'vagrant'
brew 'wdiff'
brew 'wget'
brew 'yq'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'go'
brew 'imagemagick'
brew 'libmemcached'
brew 'lima'
brew 'memcached'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'nvm'
brew 'ruby'
brew 'rbenv'

# Shell
brew 'zsh-autosuggestions'

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'astropad-studio'
cask 'audio-hijack'
cask 'authy'
cask 'bartender'
cask 'carbon-copy-cloner'
cask 'choosy'
cask 'clockify'
cask 'dbngin'
cask 'discord'
cask 'divvy'
cask 'dropbox'
cask 'droplr'
cask 'fantastical'
cask 'firealpaca'
cask 'firefox'
cask 'freedom'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'grammarly'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'adoptopenjdk8'
cask 'jetbrains-toolbox'
cask 'kiwi-for-gmail'
cask 'krita'
cask 'loopback'
cask 'messenger'
cask 'miro'
cask 'mysides'
cask 'obs'
cask 'openphone'
cask 'openvpn-connect'
cask 'parallels'
cask 'parallels-virtualization-sdk'
cask 'rekordbox'
cask 'send-to-kindle'
#cask 'screenflow'
cask 'shortcutdetective'
cask 'signal'
cask 'sketch'
cask 'sketchbook'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'swiftdefaultappsprefpane'
cask 'synergy'
cask 'tableplus'
cask 'telegram'
cask 'the-unarchiver'
cask 'there'
cask 'tinkerwell'
cask 'touch-portal'
cask 'transmission'
cask 'transmit'
cask 'tunnelblick'
cask 'tuple'
cask 'typora'
cask 'unite'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'whalebird'
cask 'whatsapp'
cask 'wordpresscom'
cask 'zoom'

# Quicklook
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'

# Fonts
cask 'font-inter'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#mas 'Bear', id: 1091189122
mas 'Byword', id: 420212497
mas 'Controller', id: 1198176727
#mas 'Droplr', id: 498672703
mas 'Eye-Friendly', id: 587769990
mas 'Focus - Time Management', id: 777233759
mas 'Harvest', id: 506189836
mas 'HomeControl', id: 1547121417
mas 'Keynote', id: 409183694
#mas 'Kiwi for Gmail', id: 986304488
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Word', id: 462054704
mas 'MindNode', id: 1289197285
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Petrify', id: 1451177988
mas 'Reeder', id: 1529448980
mas 'Spark – Email App by Readdle', id: 1176895641  
mas 'Speedtest', id: 1153157709
#mas 'Spike', id: 707452888
mas 'Tayasui Sketches', id: 1178074963
mas 'Todoist', id: 585829637
mas 'ToothFairy', id: 1191449274
mas 'Trello', id: 1278508951
mas 'Twitter', id: 1482454543
mas 'Vectornator', id: 1219074514
